#!/bin/bash

### =================================================================================
# @名称:         change_ssh.sh
# @功能描述:     修改 SSH 端口的脚本。
# @作者:         oliver556
# @版本:         0.1.0
# @创建日期:     2025-07-15
# @修改日期:     2025-07-25
#
# @许可证:       MIT
### =================================================================================

### === 导入修改 SSH 端口 脚本 === ###
source "$ROOT_DIR/shell_scripts/system/change_ssh.sh"

### === 修改 SSH 端口 主菜单 === ###
#
# @描述
#   本函数用于显示修改 SSH 端口主菜单。
#
# @示例
#   change_ssh_menu
###
change_ssh_menu() {
    while true; do
        clear
        sub_menu_title "🖥️  SSH 端口修改"
    done
}